---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.InaccurateFailures.InaccurateMassingSketchLine
source: html/ae6512d9-06e0-0393-0d7c-381225186fe8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.InaccurateFailures.InaccurateMassingSketchLine Property

Line in Massing Sketch is slightly off axis and may cause inaccuracies.

## Syntax (C#)
```csharp
public static FailureDefinitionId InaccurateMassingSketchLine { get; }
```